app/views/orders/index.html.erb

           <th scope="row"><%= i+=1 %></th>
           <font color="" size="3"> <td><%= order.order %></td>
---
SELECT `orders`.* FROM `orders`