app/views/orders/show.html.erb

<h1><font color="brown"><u> Order:</u></font>
  <i class="fa fa-american-sign-language-interpreting" aria-hidden="true"></i> <%= @order.order %></h1>
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1