app/views/user/index.html.erb

	        <!-- <img class="img-responsive" width="50"  src="/images/2.jpg" alt=""> -->
	       <font color="heavycyan" size="3"><u> <strong><%= myord.order%></strong></u>&nbsp;&nbsp; on &nbsp;&nbsp;<%= myord.created_at%></font><br/><br/>
---
SELECT `orders`.* FROM `orders`


	    	<% User.all.each do |user| %>
---
SELECT `users`.* FROM `users`