app/controllers/friends_controller.rb

  def index
    if (current_user)
    @friends = Friend.all
    @users = User.all
---
SELECT `friends`.* FROM `friends`
SELECT `users`.* FROM `users`

  def show
    @friend = Friend.find(params[:id])
---
SELECT  `friends`.* FROM `friends` WHERE `friends`.`id` = 0 LIMIT 1

  def create
    if (current_user)
    @friend = Friend.new(friend_params)
    @friend.group_id=params[:group_id]

    @users = User.all
    @friends = Friend.all
    flag=0
    addgroup=0
    duplicatefriend=0
    duplicategroup=0
    for user in @users do
      if user.email == @friend.email
          flag=1
          for fuser in @friends do
              if (current_user.id==fuser.user_id)&&(user.id==fuser.friend_id)&&(fuser.group_id==nil)
                duplicatefriend=1
              end
          end
              if params[:group_id]==nil
                if duplicatefriend==0
                    @friend['user_id']=current_user.id
                    @friend['friend_id']=user.id
                    @friend['email']=nil
                    @friend.group_id=nil
                    # add new notification for add new friend
                    @notification = Notification.new
                    @notification.user_id=current_user.id
                    @notification.message="Add new friend to his list friends ^_^"
                    @notification.addfriend=user.id
                    @notification.save
---
SELECT `friends`.* FROM `friends`
SELECT `users`.* FROM `users`
INSERT INTO `friends` (`group_id`, `user_id`, `friend_id`, `created_at`, `updated_at`) VALUES (3, 1, 2, '2016-05-21 09:58:23', '2016-05-21 09:58:23')

  def destroy
    if (current_user)
      if @friend.group_id==nil

          # add new notification for delete his friend from his list friends
          @notification = Notification.new
          @notification.user_id=current_user.id
          @notification.message="Delete his friend from his list friends - _ -"
          @notification.delfriend=@friend.friend_id
           @notification.save
          # @friend.destroy
          Friend.where(user_id:@friend.user_id,friend_id:@friend.friend_id).destroy_all
          respond_to do |format|
            format.html { redirect_to friends_url, notice: 'Friend was successfully destroyed.' }
            format.json { head :no_content }
          end
      else
          group_id=@friend.group_id
---
DELETE FROM `friends` WHERE `friends`.`id` = 26
SELECT `friends`.* FROM `friends` WHERE `friends`.`user_id` = 1 AND `friends`.`friend_id` = 2
SELECT  `friends`.* FROM `friends` WHERE `friends`.`id` = 26 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1

    def set_friend
      @friend = Friend.find(params[:id])
---
SELECT  `friends`.* FROM `friends` WHERE `friends`.`id` = 25 LIMIT 1