app/controllers/orders_controller.rb

  def index
    if (current_user)
     @orders = Order.all
---
SELECT `orders`.* FROM `orders`

  def create
    if (current_user)
    @order = Order.new(order_params)
    @order['user_id']=current_user.id
    respond_to do |format|
      if @order.save
---
INSERT INTO `orders` (`order`, `place`, `Image`, `user_id`, `date`, `created_at`, `updated_at`) VALUES ('lunch', 'mac', '', 1, '2016-05-22 07:43:00', '2016-05-22 07:43:23', '2016-05-22 07:43:23')

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE `orders` SET `place` = 'tom &bosy', `updated_at` = '2016-05-22 07:45:47' WHERE `orders`.`id` = 3