app/controllers/user_controller.rb

	def index
		if(current_user)
			@users = User.all
			@currentuser=[]
			for use in @users do
      			if current_user.id == use.id
            		@currentuser << use
    			end
    		end


			@orders = Order.all
			@friends = Friend.all
---
SELECT `users`.* FROM `users`
SELECT `orders`.* FROM `orders`
SELECT `friends`.* FROM `friends`